# Задача 2: Найдите сумму цифр трехзначного числа.
a = 789
sum = (a//100)+((a//10) % 10)+(a % 10)
print(sum)
