"""
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
"""

s = int(input("Cколько журавликов сотворили все дети вместе?"))
print("Катины журавлики:", s/6*4)
print("Сережины журавлики:", s/6)
print("Петины журавлики:", s/6)
